Vulnerability-report-main/Eligibility-Batch-ESB/ESB-Batch-routes/src/main/resources/ca/gov/moh/hsa/esb/service/batch/batchExceptionTemplate.vm

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
  </soap:Header>
  <soap:Body>

<v3:MCCI_IN200101BC ITSVersion="XML_1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:v3="urn:hl7-org:v3">
	<v3:id root="2.16.840.1.113883.3.51.1.1.1" extension="${headers.HSA_TRANSACTION_ID}"/>
	<v3:creationTime value="${headers.CREATION_TIME}"/>
	<v3:responseModeCode code="I"/>
	<v3:versionCode code="Ballot2012May"/>
	<v3:interactionId root="2.16.840.1.113883.3.51.1.1.2" extension="QUCR_IN200101BC"/>
	<v3:profileId root="2.16.840.1.113883.3.51.7" extension="BC.CR.BATCH.R1.1"/>
	<v3:transmissionQuantity value="2"/>

	<!-- Everything else after here is the batch messages-->
	
	<v3:receiver typeCode="RCV">
		<v3:device classCode="DEV" determinerCode="INSTANCE">
			<v3:id root="${headers.SENDING_DEVICE_OID}" extension="${headers.SENDING_DEVICE}"/>
			<v3:asAgent classCode="AGNT">
				<v3:representedOrganization classCode="ORG" determinerCode="INSTANCE">
					<v3:id root="${headers.SENDING_ORG_OID}" extension="${headers.SENDING_ORG}"/>
				</v3:representedOrganization>
			</v3:asAgent>
		</v3:device>
	</v3:receiver>
	<v3:sender typeCode="SND">
		<v3:device classCode="DEV" determinerCode="INSTANCE">
			<v3:id root="2.16.840.1.113883.3.51.1.1.5" extension="BCHCIM"/>
			<v3:asAgent classCode="AGNT">
				<v3:representedOrganization classCode="ORG" determinerCode="INSTANCE">
					<v3:id root="2.16.840.1.113883.3.51.1.1.200" extension="MOH"/>
				</v3:representedOrganization>
			</v3:asAgent>
		</v3:device>
	</v3:sender>
	<v3:acknowledgement typeCode="AE">
		<v3:targetBatch>
			<v3:id root="2.16.840.1.113883.3.51.1.1.1" extension="${headers.BATCH_ID}"/>
		</v3:targetBatch>
                    #foreach ($ack in ${exchange.properties.acks})
                        ${ack}
                    #end
        </v3:acknowledgement>
</v3:MCCI_IN200101BC>
  </soap:Body>
</soap:Envelope>